app/controllers/conversations_controller.rb

  def show
    @users = User.all
---
SELECT "users".* FROM "users"