app/controllers/conversations_controller.rb

SELECT "conversations".* FROM "conversations"
---
  def index

    @conversations = Conversation.all

SELECT "messages".* FROM "messages" WHERE "messages"."conversation_id" = $1  [["conversation_id", 1]]
---
  def show
    @messages = Message.where(conversation_id: params[:id])

SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = ? LIMIT 1  [["id", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."conversation_id" = ?  [["conversation_id", 1]]
---
  def edit
    @conversation = Conversation.find(params[:id])
    gon.conversation_id = @conversation.id
    @messages = Message.where(:conversation_id => params[:id])

INSERT INTO "conversations" ("recipient_id", "sender_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["recipient_id", 1], ["sender_id", 4], ["created_at", "2016-04-14 00:40:42.950368"], ["updated_at", "2016-04-14 00:40:42.950368"]]
---
  def create
    @conversation = Conversation.new(conversation_params)
    # @message = Message.create!(content: "Your chat has started.", conversation_id: @conversation.id)

    respond_to do |format|
      if @conversation.save

SELECT "conversations".* FROM "conversations" WHERE ((conversations.sender_id = '4' AND conversations.recipient_id = '1') OR (conversations.sender_id = '1' AND conversations.recipient_id = '4'))
---
    def set_conversation
      # @messages = Message.where(conversation_id: params[:id])
      @conversation = Conversation.find(params[:id])