app/controllers/messages_controller.rb

  def index
    @messages = Message.all
---
SELECT "messages".* FROM "messages"

  def create
    # Associate text body with this message's body
    if params[:message][:content] != "" and params[:message][:content] != nil
      @message = Message.create!(content: params[:message][:content], conversation_id: params[:message][:conversation_id])
      @conversation = Conversation.find(params[:message][:conversation_id])
---
INSERT INTO "messages" ("body", "conversation_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "hey"], ["conversation_id", 1], ["user_id", 4], ["created_at", "2016-04-14 00:40:48.382652"], ["updated_at", "2016-04-14 00:40:48.382652"]]
SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = $1 LIMIT 1  [["id", 1]]

    def set_message
      @message = Message.find(params[:id])
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", 52]]