app/controllers/surveys_controller.rb

INSERT INTO "surveys" ("rating", "text", "conversation_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["rating", 3], ["text", "hey"], ["conversation_id", 2], ["created_at", "2016-04-24 00:23:28.475479"], ["updated_at", "2016-04-24 00:23:28.475479"]]
---
  	def create
  		if params["rating-input-1"].nil?
  			return
  		end
  		Survey.create({:rating => params["rating-input-1"], :text => params[], :conversation =>  @conversation})