app/controllers/users_controller.rb

SELECT  "conversations".* FROM "conversations" WHERE ((conversations.sender_id = 1 AND conversations.recipient_id = 2) OR (conversations.sender_id = 2 AND conversations.recipient_id = 1))  ORDER BY "conversations"."id" ASC LIMIT 1
---
  def index
    @users = User.all
    @conversations = Conversation.all