app/controllers/users_controller.rb

INSERT INTO "users" ("name", "role_id", "email", "encrypted_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
UPDATE "users" SET "last_seen" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["last_seen", "2016-04-24 21:20:42.590282"], ["updated_at", "2016-04-24 21:20:42.593378"], ["id", 4]]
---
  def create
    respond_to do |format|
      if @user.save