app/controllers/welcome_controller.rb

INSERT INTO "conversations" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-03-19 05:50:16.599551"], ["updated_at", "2016-03-19 05:50:16.599551"]]
---
  def new_survivor
    @user = User.new_survivor()
    sign_in(@user, event: :authentication )
    sign_in @user, :bypass => true
    #@conversation = @user.generate_conversation
    @conversation = Conversation.create()